Revit 2027 API
RebarUpdateCurvesData.AlignedFreeFormSetOrientationOptions Property
Note: This API is now obsolete.
 Orientation options for an Aligned Free Form Rebar set.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("This property is deprecated in Revit 2027 and might be removed in a future version. Please use Autodesk.Revit.DB.Structure.RebarRebarFreeFormAccessor.FreeFormSetOrientationOptions property instead.")]
public AlignedFreeFormSetOrientationOptions AlignedFreeFormSetOrientationOptions { get; }
<ObsoleteAttribute("This property is deprecated in Revit 2027 and might be removed in a future version. Please use Autodesk.Revit.DB.Structure.RebarRebarFreeFormAccessor.FreeFormSetOrientationOptions property instead.")>
Public ReadOnly Property AlignedFreeFormSetOrientationOptions As AlignedFreeFormSetOrientationOptions
	Get
public:
[ObsoleteAttribute(L"This property is deprecated in Revit 2027 and might be removed in a future version. Please use Autodesk.Revit.DB.Structure.RebarRebarFreeFormAccessor.FreeFormSetOrientationOptions property instead.")]
property AlignedFreeFormSetOrientationOptions AlignedFreeFormSetOrientationOptions {
	AlignedFreeFormSetOrientationOptions get ();
}
[<ObsoleteAttribute("This property is deprecated in Revit 2027 and might be removed in a future version. Please use Autodesk.Revit.DB.Structure.RebarRebarFreeFormAccessor.FreeFormSetOrientationOptions property instead.")>]
member AlignedFreeFormSetOrientationOptions : AlignedFreeFormSetOrientationOptions with get
Property Value
AlignedFreeFormSetOrientationOptions
See Also
Reference
RebarUpdateCurvesData Class
Autodesk.Revit.DB.Structure Namespace